{
  "flow_type": "template",
  "flow_name": "esm_rt_think_math",
  "status": "released",
  "rows": [
    {
      "type": "display_group",
      "name": "dg_top_of_page",
      "rows": [
        {
          "type": "title",
          "name": "spacer",
          "value": "Thinking Mathematically",
          "_translations": {
            "value": {}
          },
          "style_list": [
            "flex:1"
          ],
          "_nested_name": "dg_top_of_page.spacer"
        }
      ],
      "_nested_name": "dg_top_of_page"
    },
    {
      "type": "display_group",
      "name": "dg_info",
      "parameter_list": {
        "style": "column"
      },
      "rows": [
        {
          "type": "text",
          "name": "help_text",
          "value": "These are tasks that emphasize problem solving ideas. These are based on the ideas in John Mason's book Thinking Mathematically. Use these to talk about and practice problem solving techniques. The ones with asterisks are too advanced for the current material.\n\n1. Draw small number of lines across a oval or rectangle. Can the result always be colored with 2 colors?\n\n2. How many squares in an nxn chessboard? How many rectangles on an nxm board? What about if diagonals are allowed?\n\n3. * A goat is tethered with a 6 foot rope to the corner of a large barn. How much area can it graze? What happens if it is tethered 3 feet from the corner? What if the goat is tethered to the corner of a 4 by 5 foot shed?\n\n4. There are 8 cubes of the same size. Two are red, two are blue, two are green, and two are white. How many ways can these 8 cubes be put together to form a larger cube so that the larger cube has every color on its face?\n\n5. There are beetles, lizards, and worms. The number of worms is more than the combined total of beetles and lizards. There are 12 heads and 26 legs. How many of each one are there? What if we increase the numbers a lot? What if there are lizards, beetles, and spiders?\n\n6. * N points are evenly spaced around a circle. A thread is attached to every mth point. Additional threads are used until all points are attached. For any given N and m, how many threads will be needed?\n\n7. Leapfrog. There are 11 holes in a row. There are 5 black pegs in the holes at one end and 5 white pegs in holes on the other end and one empty hole in the middle. A peg can only be moved to an empty hole or jump over another peg into an empty hole. Can the white and black pegs swap ends?\n\n8. A very heavy desk can only be moved by rotating it 90 degrees about one of its four corners. Is it possible to move it so that it is exactly next to its old position and still facing in the same direction?\n\n9. * Consecutive sums. If we add up two or more consecutive positive numbers, which sums are possible?\n\n10. * Which numbers are expressible as the difference of two perfect squares.\n\n11. 9 pieces of paper with the numbers 1 to 9 are placed on a table. Players take turns taking a piece of paper. The first player to get a sum of 15 using any three of their numbers wins. What is a winning strategy (if there is one)?\n\nThere are many more.",
          "_translations": {
            "value": {}
          },
          "_nested_name": "dg_info.help_text"
        }
      ],
      "_nested_name": "dg_info"
    },
    {
      "type": "display_group",
      "name": "fake_group",
      "rows": [
        {
          "type": "text",
          "name": "spacer",
          "_nested_name": "fake_group.spacer"
        }
      ],
      "_nested_name": "fake_group"
    }
  ],
  "_xlsxPath": "EFM_rich_tasks_high_level_sheets.xlsx"
}