{
  "flow_type": "template",
  "flow_name": "esm_rt_open_ended",
  "status": "released",
  "rows": [
    {
      "type": "display_group",
      "name": "dg_top_of_page",
      "rows": [
        {
          "type": "title",
          "name": "spacer",
          "value": "Open-Ended Math Tasks",
          "_translations": {
            "value": {}
          },
          "style_list": [
            "flex:1"
          ],
          "_nested_name": "dg_top_of_page.spacer"
        }
      ],
      "_nested_name": "dg_top_of_page"
    },
    {
      "type": "display_group",
      "name": "dg_info",
      "parameter_list": {
        "style": "column"
      },
      "rows": [
        {
          "type": "text",
          "name": "help_text",
          "value": "These are tasks that invite playing around. Some are EFM puzzles, which are covered elsewhere. They are also questions and puzzles that do not necessarily have a small set of answers The point is to invite exploration and play, and then for students to look for interesting new places to take the inquiry to.\n\nPeter Liljedahl's book Mathematics Tasks for the Thinking Classroom for K-3 has 50 tasks with detailed suggestions for each one. I bet we could make use of quite a few of them (with proper recognition).\n\nSome of these will be ideas from Mike F's Open-Ended Math Tasks notebook. Here are some ideas from his notebook. This can of course be expanded with ideas from other sources. Each of these that we decide to use will need a full discussion. Perhaps some of the more interesting What do you Notice and What do you Wonder tasks could go in here?\n\n**Shapes and Properties**\n* Which of These is Not Like the Others\n* Some of the EFM puzzles about shapes and multiple pieces\n\n**Counting**\n* Dot Talks\n* EFM puzzles for consecutive numbers\n\n**Addition and Subtraction**\n* You are building a zoo that has an enclosure for each kind of animal. At the moment there are five kinds of animals and a total of 20 animals. Use different numbers. Add restrictions, such as every enclosure has to have at least 2 animals or no enclosure can have a multiple of 5 animals.\n* There are birds on a wire. They are in groups of 2, 4, 7, 3, 6, and 5. How many are there altogether? What are some ways to do this? Are some easier than others. Do this with other combinations of bird counts.\n* There are the following numbers in a bag: 21, 8, 16, 32, 65, and 14. You win if you can select three of these numbers that do any of the following: a) add up to less than 50; b) add up to a multiple of 5; c) add up to more than 80.\n* A farmer forgot how many pigs and chickens he had. However, he looked under the barn door and saw that there were 30 feet. What are the possible counts?\n* Using the numbers from 0 to 9 at most once, find ways of picking three of them that add up to 12. How many ways can you do it? What is the most and the least that three of these numbers can add up to? How does the count change as you count the number of ways from the least to the most (the counts are symmetric for one thing).",
          "_translations": {
            "value": {}
          },
          "_nested_name": "dg_info.help_text"
        }
      ],
      "_nested_name": "dg_info"
    },
    {
      "type": "display_group",
      "name": "fake_group",
      "rows": [
        {
          "type": "text",
          "name": "spacer",
          "_nested_name": "fake_group.spacer"
        }
      ],
      "_nested_name": "fake_group"
    }
  ],
  "_xlsxPath": "EFM_rich_tasks_high_level_sheets.xlsx"
}