{
  "flow_type": "data_list",
  "flow_name": "esm_intro_starts_egs_list",
  "data_list_name": "esm_intro_starts_egs_data_list",
  "status": "released",
  "rows": [
    {
      "id": "esm_egs_subitizing",
      "name::eng": "Learn about a topic – Subitizing",
      "dont_use_glossary_button": true,
      "block1_type": "all_text",
      "block1_text::eng": "This example explores learning about a subject or topic area. We will use \"subitizing\" as our example topic. There are at least four ways to learn more about it in this app.",
      "block2_type": "accord_all_text",
      "block2_accord::eng": "Topics",
      "block2_text::eng": "Navigate to the topic you are interested in:\n* From Home Page, press Topics button to go to the Topics Page.\n* On the Topics Page select \"Topics View and Finder.\"\n* Assuming you are using the ESM view, looking at the high level strands, you explore \"Number & Place Value.\" \n* Within that, subitizing involves small quantities, so you select \"Quantities & Counting to 10.\" \n* Here you see the button for the topic \"Subitizing to 10.\"\n\nAlternatively, from the Topics Page go to \"Learning Pathways\" and find Subitize as part of the \"Quantities & Counting\" pathway.\n\n**Subitizing Topic** On the topic page for Subitizing to 10 you will find discussions of the importance of subitizing, its relationship to unitizing, beginning standard dot arrangements to use, the use of ten frames, and its link to Counting On. There is also a tip about five frames being not so useful for subitizing. \n\nAt the bottom of this topic page you will find:\n* A pull down list of Related Topics. At the moment, this list displays 2 topics that come before this topic, and 5 topics that are natural next steps.\n* A link to the Resource Finder. This will search for resources related to subitizing. At the moment it finds 3 games and 11 routines.\n* A link to the Glossary. This takes you to the Glossary and starts by displaying phrases related to the current topic (if any have been specified). In this case, it highlights glossary entries for Counting On, Subitizing, Ten Frames, and Unitizing.",
      "block3_type": "accord_all_text",
      "block3_accord::eng": "The Resource Finder",
      "block3_text::eng": "Navigate to the Resource Finder:\n* From Home Page, press Resources button. \n* On the Resources page there is a Resource Finder button in the upper right corner.\n\nUse the dropdown menus near the top of the page to select topics you wish to search on. Those menus are the same as the ones you see on the Topics page. Listed at the bottom of the page are all the resources in the app that are associated with the topics you selected.\n\nAs in the \"Topics\" example above, suppose you navigate to the \"Quantities and Counting to 10\" Theme, and then pick the \"Subitizing to 10\" topic. Additionally, to broaden the search in that same general topic area, suppose you also add the topic \"Quantities and Counting\" to the list of search topics. \n\nThe search results show all the resources related to at least one of those two topics. You can now choose from:\n* 26 Puzzles\n* 13 Games\n* 27 Storybooks\n* 11 Routines\n* 9 Open-Ended Tasks",
      "block4_type": "accord_all_text",
      "block4_accord::eng": "Glossary",
      "block4_text::eng": "Navigate to the Glossary:\n* From Home Page, press Resources button. \n* Select Glossary button to get to its list of terms. \n* Scroll down to find the entry for \"subitizing.\" \n\nThis entry has a short description of the term, an example, and a discussion of its importance and relationship to unitizing.\n\nAt the bottom of this entry, you can select \"Related Topics\" to find further information about it. At the moment, this only lists the topic \"Subitizing to 10.\"",
      "block5_type": "accord_all_text",
      "block5_accord::eng": "Instructional Routines",
      "block5_text::eng": "Maybe you've seen a Dot Card or a Splat Card and want to learn more about those routines or find other quick routines like them. \n\nNavigate to the Instructional Routines:\n* From Home Page, press Resources button.\n* Select the \"Instructional Routines\" button.\n\nThe Instructional Routines are currently grouped into three levels:\n* Shapes and Properties\n* Small Quantities and Counting\n* Numbers and Operations\n\nSince you are interested in subitizing, you select \"Small Quantities and Counting.\" There you find:\n* Dot Talks – Beginning\n* Splat!\n* Number Line Tasks\n* Choral Counting\n* Short Games – Counting\n\nThe first two of these provide many examples to give you ideas for running activities that involve subitizing. The next two have counting and sequencing activities. The last has five suggested games that involve counting, and a button to take you to the Games section."
    },
    {
      "id": "esm_egs_routines",
      "name::eng": "You want a quick Routine",
      "dont_use_glossary_button": true,
      "block1_type": "all_text",
      "block1_text::eng": "Suppose you want an activity for a short period of time, say 1 to 10 minutes. You might want something that is playful and active, or you might want a short lesson to introduce or reinforce a topic or skill.",
      "block2_type": "accord_all_text",
      "block2_accord::eng": "A Quick Playful Activity",
      "block2_text::eng": "The games for breaks option is a good fit for this.\n\nNavigate to these games:\n* From Home Page, select Resources button\n* On Resources Page, select Games button\n\nOn the Games Page, turn off (slide left) the slider for \"All\" and turn on (slide right) the slider for \"Breaks.\" Select the levels that are appropriate for your class \n\nThere are quite a few games to choose from, and only some of them are active, so you will need to explore a bit to find what you want on this list.",
      "block3_type": "accord_all_text",
      "block3_accord::eng": "A Quick Math Lesson",
      "block3_text::eng": "The Instructional Routines section is designed to have resources for this situation. \n\nNavigate to the Instructional Routines:\n* From Home Page, press Resources button.\n* On Resources page, select the \"Instructional Routines\" button.\n\nThe Instructional Routines section is broken up into resources by math skill level. At the moment, the Routines section is split into three topic areas:\n* Shapes and Properties\n* Small Quantities and Counting\n* Numbers and Operations"
    },
    {
      "id": "esm_egs_richtasks",
      "name::eng": "You want a Rich Task",
      "dont_use_glossary_button": true,
      "block1_type": "all_text",
      "block1_text::eng": "Rich Tasks involve a deeper exploration into a math question or subject. These usually involve at least one lesson period, and many can be extended into several lessons as you guide or follow the students' interests and questions.\n\nNavigate to Rich Tasks:\n* From Home Page, select Resources\n* On Resources Page, select Rich Tasks\n\nThe Rich tasks come in two types – Open-Ended Tasks and Problem Solving Tasks.",
      "block2_type": "accord_all_text",
      "block2_accord::eng": "Open-Ended Tasks",
      "block2_text::eng": "These are tasks that invite playing around. They are questions and puzzles that are not narrowly focused and do not necessarily have a small set of answers The point is to invite exploration and play, and then for students to look for interesting new places to take the inquiry. These tasks all students to be heard and are ripe for lots of discussion and exploration.\n\nWe are developing this section at the moment. It currently has a few Thinking Tasks from Peter Liljedahl and Open-Ended tasks from Mike Fitchett.",
      "block3_type": "accord_all_text",
      "block3_accord::eng": "Problem Solving Tasks",
      "block3_text::eng": "These activities involve more closely defined solutions and goals. They talk about and practice problem solving techniques and strategies. See the Problem Solving Overview for general ideas about problem solving. Many of the activities in this section were adapted from John Mason's book Thinking Mathematically.\n\nThese activities are organized by topic level. This section is in development. At the moment it has five activities in each of two levels:\n* Early Logic\n* Early Counting, Add, Subtract\n\nIn addition to these, many of the puzzles in the Puzzles section are ripe areas for a rich task."
    }
  ]
}