{
  "flow_type": "data_list",
  "flow_name": "esm_num_line_list",
  "data_list_name": "esm_num_line_data_list",
  "status": "released",
  "rows": [
    {
      "id": "esm_nl_1",
      "name::eng": "Counting & Order",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NPV_QC10_Ordinals",
      "topic_theme_4": "NPV_CPV100_Count20",
      "block1_type": "all_text",
      "block1_text::eng": "Use number paths to practice counting and putting numbers in order. This helps develop counting, sequencing, and number sense.\n\n**Examples:**\n* Leave out some of the numbers (without leaving blank spaces). Have your students figure out what is missing and have them place the missing cards where they should be. To add some fun, do this without your students noticing and wait until some of the students point out there is a problem. This can be a daily game to play.\n* Scramble up some or all of the numbers and ask your students to put them on the path in the usual order."
    },
    {
      "id": "esm_nl_2",
      "name::eng": "Add Subtract 1 & 2",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NO_AS10_AS1and2",
      "block1_type": "all_text",
      "block1_text::eng": "This is a sequence of steps for teaching adding 1 or 2 or subtracting 1 or 2 using a number path. Have a number path to 10 (or 15 or 20) on a ledge where all the students can see it.\n\n**Random Cards:** In addition to the number path, have a shuffled deck of cards with numbers you want to practice.\n* Hold up a card from the deck directly above the same card on the path. Suppose the number pulled from the deck is 6. Pointing forward to the nearby path numbers say \"What's 1 more than 6?\" After a while, simplify this to \"What's 1 more?\"\n* After the students are comfortable doing the previous step, hold the cards from the deck nearby but not on the humber path, so the students can still see the number path. Ask the same questions.\n* After a while mix in pointing at the card and saying simply \"plus 1\" and have them give you the number.\n\nDo the same thing, one at a time (taking a lot of time to develop each one), with 2 more (or \"plus 2\"), go back 1 (or \"1 less\"), and go back 2 (or \"2 less\").\n\n**Mix Them** Then, start mixing these four calculations. Select a number card from the deck, go to the number on the path, and ask for all four nearby numbers (using the previous phrases). After this is easy, move a little bit away from the number path and continue doing it.\n\n**Taped Card Sequence:** Next, have a sequence of cards that are taped together or otherwise connected. Flip through the numbers and ask for their relationship.\n\nFor example,\n* Suppose the first card is 6. Say \"What are we at?\" and the students say 6.\n* Now keep showing the 6 and show the next card (a 4) - the students say \"2 less.\"\n* Fold back the 6, showing only the 4 and say \"What are we at?\" and the students say 4.\n* Now keep showing the 4 and show the next card (a 5) - the students say \"1 more\".\n* Fold back the 4, showing only the 5 and say \"What are we at?\" and the students say 5.\n* Now keep showing the 5 and show the next card (a 7) - the students say \"2 more.\"\n* And so on."
    },
    {
      "id": "esm_nl_3",
      "name::eng": "Placing Expressions",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NPV_QC10_Ordinals",
      "topic_theme_4": "NPV_CPV100_Count20",
      "block1_type": "all_text",
      "block1_text::eng": "Draw a number line without tick marks with just 2 or 3 numbers on it. For example, the numbers might be 3, 5, and 9 put at appropriate distances.. With that line, give your students some number sense tasks:\n* Have them put one or more new numbers in approximately the right place on the line. For example, if the line goes from 0 to 10, where should a 2, 4, and 8 go?\n* As they are able to do more sophisticated calculations, have them find the approximate place for a group of more complicated numbers and expressions. For example, if the line groes from 0 to 5, where approximately would 7/8, 1 2/5, and 8 divided by 3 go?"
    },
    {
      "id": "esm_nl_4",
      "name::eng": "Number Path and Number Line Games",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NPV_QC10_Ordinals",
      "topic_theme_4": "NPV_CPV100_Count20",
      "block1_type": "all_text",
      "block1_text::eng": "There are several games that use number paths, number lines, or 100 Charts. Each of these games are fun and relatively quick ways to interact with these number sequence representations.\n\n* Number Path – The game \"Back and Forth\" involves using a die to determine how far to count foward and backward on the path. The game of Hopscotch is a classic number path game.\n* Number Line – The games \"Number Line Battleship\" and \"I'm Thinking of a Number\" can be played on number lines. The battleship game may be a little long for a short break.\n* 100 Chart – The game \"Short Steps to a Target\" can be shown best on a 100 Chart.",
      "block2_type": "button",
      "block2_accord::eng": "Games",
      "block2_text::eng": "efm_ga_start"
    }
  ]
}