{
  "flow_type": "data_list",
  "flow_name": "esm_choral_counting_list",
  "data_list_name": "esm_choral_counting_data_list",
  "status": "released",
  "rows": [
    {
      "id": "esm_choral_count_1",
      "name::eng": "Count by 1s from 1 and 0",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NPV_CPV100_Count20",
      "glossary_count": 0,
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Count by 1s from 1 and 0**\n\n**Start by using Reference Objects** Use number paths, number lines, and objects to help your students relate to the counting. As you do beginning counting together, point to the numbers on a number path or number line as they are said aloud. Counting objects, even your students, will help them see what the numbers they are saying mean.\n\nStart with basic counting to a small number, such as 5. Slowly extend the range of the numbers and also the type of counting you do. Counting down is just as important as counting up.\n\n**Larger Ranges – Start Writing and Discussing** Start writing down the numbers once you begin working with numbers above 10. Begin by writing the numbers in rows or columns of size 10. \n\n**Tricky Spots**\n* Early teens – The number names for the early teens are unusual and typically need extra time to consolidate.\n* Names for tens – Practice the names for tens separately, perhaps using choral counting, to have them more at hand when needed for this counting.\n* Decade transitions – Allow extra time for such transition points and spend more time discussing them.\n\n**Patterns** For this discussion, let's assume you wrote the numbers in rows. Look for observations about how the ones digits progress the same way in every row, the tens digit is the same in a row (until the end), and the tens digits progress by 1 from row to row. Talk about how the tens digit increasing by 1 happens because the the numbers are larger by 10. You can also look at diagonals and see that both the ones and tens digits increase by 1 with each step.\n\n**Starting at 0** Starting at 0 is important for making 0 a real number that has meaning to them. Also, starting at 0 will change the layout of the written numbers in an interesting way – the tens place will be the same in the intire row (or column), and the ones place will increase from 0 to 9 rather than going from 1 to 9 and back down to 0."
    },
    {
      "id": "esm_choral_count_2",
      "name::eng": "Count by 1s starting above 1",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NPV_CPV100_Count20",
      "glossary_count": 1,
      "glossary_1": "counting on",
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Count by 1s starting above 1**\n\n**Counting On** It is called Counting On when you count starting with a number larger than 1. For example, if your students are counting 7 objects and your students can immediately subitize 3 of them, then they can count all the objects by counting on from 3: \"3, 4, 5, 6, 7.\"\n\n**Start by using Reference Objects** Use number paths, number lines, and objects to help your students relate to the counting. As you do beginning counting together, point to the numbers on a number path or number line as they are said aloud. Counting objects, even your students, will help them see what the numbers they are saying mean. To include Counting On, count out a selection of the objects and put them aside – and then continue from that number to count the rest of the objects.\n\n**Writing the Numbers** Write these numbers as you would if you were starting at 0 or 1 – just leave blank spaces for the numbers you are leaving out. Not surprisingly, your students should see the same number patterns emerge for the organized writing of these numbers as they did when they were starting at 1."
    },
    {
      "id": "esm_choral_count_3",
      "name::eng": "Count by 1s Down to 1 or 0",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NPV_CPV100_Count20",
      "glossary_count": 0,
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Count by 1s Downward to 1 or 0**\n\n**Use Reference Objects** Use number paths, number lines, and objects to help your students relate to the counting. This is as helpful for counting down as it was for counting up. Counting down is easy to do whenever you are counting down seconds or counting how many things are left as they are being removed. \n\nStart with basic counting from a small number, such as 5. Slowly extend the range of the numbers. It is helpful to end at 0 sometimes so that 0, as nothing, becomes a familiar concept.\n\n**Counting down deepens understanding** Many students get used to counting upward automatically and without thinking. Counting down is usually not as automatic and it encourages more thought. It is particularly effective when crossing between decades, such as counting \"72, 71, 70, 69, 68,\" and that thoughtfullness will lead to deeper understandings. Counting down is also helpful for subtraction when doing take away or finding the distance between two numbers.\n\n**Writing the Numbers** This is done exactly as for counting up, only now the numbers and all the patterns will be in the reverse order."
    },
    {
      "id": "esm_choral_count_4",
      "name::eng": "Count by 1s – 2 & 3-digits",
      "topic_theme_1": "NPV_QC10_QC",
      "topic_theme_2": "NPV_QC10_CMQ10",
      "topic_theme_3": "NPV_CPV100_Count20",
      "glossary_count": 0,
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Count by 1s – 2 & 3-digit Numbers**\n\n**Important Concepts**\n* Decade and 100 transitions – These transitions are the places to focus your time and attention. Practice ranges of numbers that emphasize these - e.g. 47 to 67; 85 to 105; or 103 to 123.\n* Place Value – Understanding place value adds meaning to these numbers and keeps them from just being numbers being repeated in order. For each transition place, discuss what is happening to the 1s, 10s, and 100s digits (and names).\n\n**Use Row (or Column) sizes of 10 and 5** Using a size of 10 builds on continuity from your earlier choral counting. Using a size of 5 allows for new patterns to be discovered, such as that the ones digits will alternate between two values – in the example below, the first column alternates between 7 and 2, the second column between 8 and 3, and so on.\n\n47 48 49 50 51\n52 53 54 55 56\n57 58 59 60 61\n62 63 64 65 66\n\n**Downward Counting** As before, practicing counting downward is valuable for the extra thoughtfulness it creates. Counting down is also helpful for subtraction when doing take away or finding the distance between two numbers."
    },
    {
      "id": "esm_choral_count_5",
      "name::eng": "Count by 10s, 5s, 2s",
      "topic_theme_1": "NO_MSD_Skipping",
      "topic_theme_2": "NO_AS10_AT",
      "topic_theme_3": "NO_NT_EvenOdd",
      "glossary_count": 1,
      "glossary_1": "skip counting",
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Count by 10s, 5s, 2s**\n\nThe 2s, 5s, and 10s are the easiest and most natural skip count amounts to start with, and your students will probably have fun with each one of them. As with counting by 1s, when appropriate use objects and other references to make the counting more relatable.\n\n**Skip Counting by 10s** The connection with place value makes this skip counting particularly important. It also makes it easy and familiar. Start with examples where your counting starts with a 10 (on a decade). Your students will notice the same patterns they saw when counting by 1s, only now the digits changing are in the 10s and 100s places instead of the 1s and 10s. They will also notice that the 1s place is always 0. After this becomes familiar and easy, do examples where you start counting not on the decade – for example, from 78 to 268. The patterns will be the same as going from 70 to 260, except now the 1s digit is always 8 instead of 0.\n\n**Skip Counting by 5s** As with 10s, begin with on decade examples and then extend to arbitrary examples. Play with different sizes of rows (or columns) and see if your students notice different things. Row sizes of 2, 4, 5, 10, and 20 are natural experiments to use.\n\nTalk about how many 5s there are in 10 and 100, and how those facts influence the patterns they see. If there are an even number of entries in a row, your students should notice that if they look down any row they will see the 1s digits alternate between two values. Also, the values from one row to the next will increase by 20 (if there are four items in a row, as there are in this next example).\n\n24 29 34 39\n44 49 54 59\n64 69 74 79\n84 89 94 99\n\n**Skip Counting by 2s** The directions for this are similar to those for counting by 5s. Your students may notice that if they start on an even number, all the numbers are even; if they start on an odd number, all the numbers are odd.\n\n**100 Chart** If you have a 100 Chart, do examples where you circle the numbers on the chart as you count them. Because 2, 5, and 10 divide into 10, all the circled numbers will line up in columns on the chart, and this can be a powerful visual."
    },
    {
      "id": "esm_choral_count_6",
      "name::eng": "Count by Any Single Digit",
      "topic_theme_1": "NO_MSD_Skipping",
      "glossary_count": 1,
      "glossary_1": "skip counting",
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Count by Any Single Digit**\n\nThe practice with 1s, 2s, 5s, and 10s, leads to this general skip counting. Skip counting by other numbers will not be as easy, but it is great practice for addition, subtraction, multiplication, and division. The patterns your students will discover are harder to uncover, and they are more interesting. Use any number as a starting point, not just multiples of the skip amount. \n\n**Ones Digits Patterns:** Keeping a record of the numbers on the board or on a 100 Chart will bring out some interesting patterns in the ones digits. Why do those happen? Skip counting by 1s, 3s, 7s, and 9s will hit every digit in the ones place. Skip counting by 2s, 4s, 6s, and 8s, will hit five of the digits. Skip counting by 5s will only hit two of the digits. See what sense your students can make of those patterns.\n\n**Addition Subtraction Fluency:** As your students get better at this, they can do skip counting at any time and in any place. This is a suprisingly good way to improve their fluency with basic addition and subtraction facts."
    },
    {
      "id": "esm_choral_count_7",
      "name::eng": "Count by 20s, 25s, 30s, 15s",
      "topic_theme_1": "NO_MSD_Skipping",
      "glossary_count": 1,
      "glossary_1": "skip counting",
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Count by 20s, 25s, 30s, 15s**\n\nCounting by 20s and 25s works out fairly easily because they evenly divide 100.\n\n**Skip Counting by 20s** Using a row (or column) length of five will bring out the relationship between 20 and 100. Experiment with other lengths to see what your students discover.\n\n**Skip Counting by 25s** Using a row (or column) length of four will demonstrate how 25 is a quarter of 100. Your students will also discover that the 1s digits will alternate between two values.\n\n**Skip Counting by 30s and 15s** These numbers do not divide evenly into 100, so the patterns will be more interesting. Doing the additions or subtractions for 15 may be particularly challenging for some, so be sure to give lots of time for difficult transition points, such as crossing into a new 100 band."
    },
    {
      "id": "esm_choral_count_8",
      "name::eng": "Beep Game",
      "topic_theme_1": "NO_MSD_Skipping",
      "topic_theme_2": "NPV_CPV100_CountPV100",
      "glossary_count": 1,
      "glossary_1": "skip counting",
      "block1_type": "all_text",
      "block1_text::eng": "**Routines – Choral Counting – Beep Game**\n\nThis is a playful and competitive form of choral counting with a group of students in a circle. Specify a starting number, a skip amount, and a direction. Decide on a rule for saying \"Beep.\" Someone starts by saying the first number, and then each person going around the circle either says the next number or they say \"Beep\" instead when the number satisfies the rule.\n\n**Examples:**\n* Say Beep for every multiple of 3 and any number ending in 3.\n* Say Beep for multiples of 4 and Boop for multiples of 5. \n\nAll sorts of rules are possible. Subsititue another word, such as \"Happy,\" if your students enjoy it more. You can find more about this game in the games section.",
      "block2_type": "button",
      "block2_accord::eng": "Games",
      "block2_text::eng": "efm_ga_start"
    }
  ]
}